[
  {
    "name": "Gram's Dried Mushroom Soup",
    "source": "Grandma",
    "category": "soup",
    "directions": "1/2 or 1 lb. marrow beans (soak overnight)\n1 onion (whole)\n1 bay leaf\n3 Parsley roots--(maybe parsnips-cut in half)\n2 T or so dried dill\n2 T parsley--green chopped\nDried Mushrooms (soak overnight)\n3 or 4 potatoes cubed\n\nBrown together,\n1/4 c oil\n1/4 medium onion\n5 or 6T. vinegar\n\nPut beans, water, onion, parsley and parsley roots, dried mushrooms, bay leaf, salt and pepper. Don't know how many mushrooms--judge for yourself about a pint or so\n\nCook about 3 hours until mushrooms are done. Add potatoes.Cook until done. Add vinegar. Cool\nBring to a boil.\n\nNow brown 1/4 onion in oil. Add to cooked soup. Pat luke warm."
  },
  {
    "name": "Anderson's Pea Soup",
    "source": "Anderson's",
    "category": "soup",
    "directions": "Recipe for 8 bowls of Anderson's Famous Split Pea soup:\n\n2 Qts. of soft water\n2 Cups of green split peas\n1 branch of celery coarsely chopped\n1 large carrot, chopped\n1 small onion, chopped\n1/4 teaspoon of ground thyme\n1 pinch of cayenne\n1 bayleaf\n3/4 t. salt\npepper\n\nBoil hard for 20 minutes then slowly strain through fine sieve slowly until peas are tender and reheat to boiling point."
  },
  {
    "name": "Spinach Soup",
    "source": "Janet Harris",
    "category": "soup",
    "directions": "4 cups broth from corned beef \n1 bay leaf \n3 or 4 cinnamon sticks \nred hot chilies \n1/2 tsp of coriander,allspice, and mustard seed \n1 onion \n\nCook corned beef in all of the above\n2 pkg frozen spinach \n1 cup sour cream \n\nBlend in blender."
  },
  {
    "name": "Chawoof",
    "source": "Grandma",
    "category": "soup",
    "directions": "1 piece fatback\n4 c. water\n1 pint chawoof\n1 potato, cubed\n\nCook fatback about 1/2 hour. Slice or cube fatback about 2 pieces size of walnut or more. Add potatoes cubed and cock 1/2 hour. (or til done.)  Then add chawoof and boil 10 minutes. Add sour cream just before eating. You can put it in your soup dish just before eating if you don't want to put it all in the soup. Make sure you don't boil sour cream the next day. It will curdle. Just heat it slowly. (You can make it in 1 hour.)"
  },
  {
    "name": "Friendship Soup",
    "source": "Beth Wright",
    "category": "soup",
    "directions": "2 carrots, washed and sliced \n1 stalk celery \n1 small onion, peeled and chopped \n2 stems of parsley, chopped \n2 medium potatoes, peeled and chopped \n1 cup canned tomatoes \n3 cups water \n2 bouillon cubes\n3/4 teaspoon salt\n2 hot dogs, sliced\n\nPut everything into the pot, let it cook;stir; turn heat down to low--let simmer, about 1 hour. Makes 5 cups--serve with crackers,"
  },
  {
    "name": "Cheese Popovers",
    "source": "Mom",
    "category": "bread",
    "directions": "Beat together with rotary beater 2 eggs and 1 cup milk. sift flour, measure 1 cup, and sift again with 1/2 tsp. salt in milk mixture. Beat until smooth Divide 1/2 cup shredded sharp Cheddar or Swiss cheese into 6 portions, placing each in bottom of well-greased custard cup, deep muffin tin, or popover pan. Pour 1/6 of the batter into each cup, over cheese. Bake in a hot oven (425) for 35 minutes. or until puffed and golden brown Serve immediately. Makes 6 popovers"
  },
  {
    "name": "Celery and Lime Soup",
    "source": "",
    "category": "soup",
    "directions": "4 C. chopped celery with leaves \n1 1/2 C chopped onion \n1/2 C. brown rice \n1/2 C. chopped parsley \n4 C water \n1 T. dill weed \n1 t. salt \n4 eggs \n1/3 c. lime juice\nsour cream\nminced parsley\n \nPut celery, onion, rice, in parsley, water, dill and salt in a soup pot. Bring to a boil. reduce heat, cover and simmer until rice is tender, about 35 to 40 minutes. Beat eggs until frothy, then slowly beat in lime juice. Add 2 cups of the pureed soup to the egg mixture, pouring continually and beating very slowly so that the eggs will not curdle. Return mixture to pot and cook and stir over low heat until slightly thickened. Do not allow to boil Remove from heat, cool, then chill for at least 5 hours Serve garnished with sour cream and parsley. Serves 6."
  },
  {
    "name": "Beet Soup",
    "source": "",
    "category": "soup",
    "directions": "5 medium beets \n2 1/2 c. water\n1 1/2 t dill weed \n3 T lemon juice \n1 c. diced cucumber \n\nCook or steam beets in their skins until fork tender. Salt lightly while cooking. slip skins and put beets in a blender or food processor with the water lemon juice and dill. Puree until smooth; cool \"then chill well. Serve garnished with cucumber. Serves"
  }
]
